app/controllers/login_controller.rb

SELECT * FROM `movies`
---
  def index
    @movies = Movie.all