app/controllers/movies_controller.rb

SELECT * FROM `movies`
---
  def index
    @movies = Movie.all

SELECT * FROM `movies` WHERE (`movies`.`id` = 0)
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO `movies` (`updated_at`, `title`, `description`, `year`, `picture`, `created_at`, `last_played`, `location`) VALUES('2010-07-22 13:01:52', 'Crappy Movie', 'Just a test.', 2301, 'none', '2010-07-22 13:01:52', NULL, 'none')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM `movies` WHERE (`movies`.`id` = 946796500)
UPDATE `movies` SET `description` = 'A fake test movie.', `updated_at` = '2010-08-23 15:19:16' WHERE `id` = 397119669
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      @movie.reload
      if @movie.update_attributes(params[:movie])

SELECT * FROM `movies` WHERE (`movies`.`title` = 'The Secrets of Faking')
DELETE FROM `movies` WHERE `id` = 40248514
---
  def update_list
    @output = " "
    params[:movie_names].each do |name|
      @output+= name
    end

    @names = params[:movie_names]
    @movies = Array.new
    @names.each do |name|
      @movies << Movie.find(:all, :conditions => { :title => name })
    end

    respond_to do |format|

      if ('edit' == params[:submit]) && (false == @movies.empty?)
        #format.html{ render "maintenance/index"}#, :movie_names => params[:movie_names]}
        format.html{ render "edit", :movies => @movies, :layout => 'maintenance'}
         flash[:notice] = @output;
      elsif ('delete' == params[:submit]) && (false == @movies.empty?)
        #destroy
         Movie.destroy(@movies)