app/controllers/shows_controller.rb

  def index
    @shows = Show.all
---
SELECT * FROM `shows`

  def show
    @show = Show.find(params[:id])
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 0)

  def update
    @show = Show.find(params[:id])

    respond_to do |format|
      if @show.update_attributes(params[:show])
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 144738175)
UPDATE `shows` SET `location` = '', `updated_at` = '2010-08-26 12:29:22' WHERE `id` = 144738175

  def update_list
    @output = " "

    @shows = Array.new
    if params[:show_names]
      params[:show_names].each do |name|
        @output+= name
      end

      @names = params[:show_names]

      @names.each do |name|
        @shows << Show.find(:all, :conditions => { :title => name })
      end
    end

    respond_to do |format|

      if ('edit' == params[:submit]) && (false == @shows.empty?)
        #format.html{ render "maintenance/index"}#, :movie_names => params[:movie_names]}
        format.html{ render "edit", :shows => @shows, :layout => 'maintenance'}
         flash[:notice] = @output;
      elsif ('delete' == params[:submit]) && (false == @shows.empty?)
        #destroy
         Show.destroy(@shows)
---
SELECT * FROM `shows` WHERE (`shows`.`title` = 'The Fake Group')
DELETE FROM `shows` WHERE `id` = 670183403