app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM `songs`

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM `songs` WHERE (`songs`.`id` = 129880807)

  def update
    @song = Song.find(params[:id])

    respond_to do |format|
      if @song.update_attributes(params[:song])
---
SELECT * FROM `songs` WHERE (`songs`.`id` = 129880807)
UPDATE `songs` SET `location` = '', `updated_at` = '2010-08-26 15:00:21' WHERE `id` = 129880807

  def update_list
    @output = " "
    params[:song_names].each do |name|
      @output+= name
    end

    @names = params[:song_names]
    @songs = Array.new
    @names.each do |name|
      @songs << Song.find(:all, :conditions => { :title => name })
---
SELECT * FROM `songs` WHERE (`songs`.`title` = 'MyString')